surfingkey.md

# Table of Contents

1.  [link and mouse click](#org65a5e54)
2.  [scroll page](#org81abdbf)
3.  [tab](#orgf4761e2)



<a id="org65a5e54"></a>

# link and mouse click

-   \`f\` - open link
-   \`cf\` - open link a new tab


<a id="org81abdbf"></a>

# scroll page

-   \`j\` - down
-   \`k\` - up
-   \`h\` - left
-   \`l\` - right
-   \`0\` - all the way to the left
-   \`$\` - all the way to the right
-   \`d\` - scroll half page down
-   \`u\` - scroll half page up


<a id="orgf4761e2"></a>

# tab

-   \`E\` - go one tab left
-   \`R\` - go one tan right
-   \`S\` - go back (history)
-   \`D\` - go forward (history)
-   \`T\` - choose a tab
-   \`g\` - for more option
-   \`zi\` - zoom in
-   \`zo\` - zoom out
-   \`x\` - close current tab
-   \`X\` - restore closed tab
-   \`W\` - move current tab to another window
-   \`w\` - switch frame (it says I am here)
-   \`gu\` - go up one path in the URL

few letter that show other command:
\`;\`, \`g\`, \`u\` , \`y\`,  \`x\`

